app/serializers/user_serializer.rb

  def bucketlist
    self.object.bucketlist.add_joiners.map do |add_joiner|
---
SELECT "add_joiners".* FROM "add_joiners" WHERE "add_joiners"."bucketlist_id" = $1  [["bucketlist_id", 1]]
SELECT "bucketlists".* FROM "bucketlists" WHERE "bucketlists"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]