app/controllers/add_joiners_controller.rb

SELECT "add_joiners".* FROM "add_joiners"
---
    def index
        add_joiners = AddJoiner.all

SELECT "add_joiners".* FROM "add_joiners" WHERE "add_joiners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        add_joiner = AddJoiner.find(params[:id])

SELECT "add_joiners".* FROM "add_joiners" WHERE "add_joiners"."bucketlist_id" = $1 AND "add_joiners"."destination_id" = $2 LIMIT $3  [["bucketlist_id", 1], ["destination_id", 3], ["LIMIT", 1]]
INSERT INTO "add_joiners" ("bucketlist_id", "destination_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["bucketlist_id", 1], ["destination_id", 3], ["created_at", "2020-11-03 21:16:48.348081"], ["updated_at", "2020-11-03 21:16:48.348081"]]
---
    def create
      # byebug
        logged_user_add_joiner = logged_user.bucketlist.add_joiners
        destination = logged_user_add_joiner.find_by(destination_id: params[:destination_id])

        if destination.nil?
            create_add_joiner = add_joiner_params.merge({bucketlist_id: logged_user.bucketlist.id})
            add_joiner = AddJoiner.create(create_add_joiner)

SELECT "add_joiners".* FROM "add_joiners" WHERE "add_joiners"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "add_joiners" WHERE "add_joiners"."id" = $1  [["id", 20]]
---
    def destroy
        add_joiner = AddJoiner.find(params[:id])

        add_joiner.destroy