app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations"
---
    def index
        @destinations = Destination.all

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def show
        @destination = Destination.find(params[:id])