app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "rating", "user_id", "destination_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "wow"], ["rating", 5], ["user_id", 2], ["destination_id", 13], ["created_at", "2020-11-03 23:49:36.798061"], ["updated_at", "2020-11-03 23:49:36.798061"]]
---
    def create
        create_review = review_params.merge({user_id: logged_user.id})
        @review = Review.create(create_review)