app/controllers/users_controller.rb

INSERT INTO "users" ("username", "picture", "bio", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "bucketlists" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-11-03 14:51:25.475027"], ["updated_at", "2020-11-03 14:51:25.475027"]]
---
    def create
      @user = User.create(user_params)
      Bucketlist.create(user_id: @user.id)

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "saima_rahman"], ["LIMIT", 1]]
---
  def login
    # byebug
    @user = User.find_by(username: params[:username])